#Область ПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
    
	ЮТТесты.ДобавитьТестовыйНабор("Реализация тестов на основе Yaxunit").ВТранзакции()
		.ДобавитьТест("ПроверитьУспешноеСозданиеДокументов")
		.ДобавитьТест("ПроверитьУспешноеПроведениеДокументовИДвижениеПоРегистру")
		.ДобавитьТест("ПроверитьВыходВНоль");
	
КонецПроцедуры    
	
Процедура ПроверитьУспешноеСозданиеДокументов() Экспорт
	
	МассивДокументов = Новый Массив;
	
	ДанныеДляЗаполненияШапки = ПолучитьДанныеДляЗаполненияШапки();
	ДанныеДляЗаполненияТабличнойЧасти = ПолучитьДанныеДляЗаполненияТабличнойЧасти();
		
	Для Сч = 0 По 2 Цикл      
		
        ДокументПриход = Документы.ПриходТовара.СоздатьДокумент();   		
        ЗаполнитьЗначенияСвойств(ДокументПриход, ДанныеДляЗаполненияШапки); 
		
		НоваяСтрока = ДокументПриход.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДляЗаполненияТабличнойЧасти); 
		
        ДокументПриход.Записать();
        МассивДокументов.Добавить(ДокументПриход); 
		
    КонецЦикла;

	Для Сч = 0 По 2 Цикл      
		
	    ДокументРасход = Документы.РасходТовара.СоздатьДокумент();
        ЗаполнитьЗначенияСвойств(ДокументРасход, ДанныеДляЗаполненияШапки);   

		НоваяСтрока = ДокументРасход.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДляЗаполненияТабличнойЧасти); 		
		
        ДокументРасход.Записать();
        МассивДокументов.Добавить(ДокументРасход);    
		
	КонецЦикла;
	
	Для Каждого Документ Из МассивДокументов Цикл
				
        ЮТест.ОжидаетЧто(Документ.Ссылка)
            .Заполнено();		
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьУспешноеПроведениеДокументовИДвижениеПоРегистру() Экспорт

	МассивДокументов = Новый Массив;
	
	ДанныеДляЗаполненияШапки = ПолучитьДанныеДляЗаполненияШапки();
	ДанныеДляЗаполненияТабличнойЧасти = ПолучитьДанныеДляЗаполненияТабличнойЧасти();
		
	Для Сч = 0 По 2 Цикл      
		
        ДокументПриход = Документы.ПриходТовара.СоздатьДокумент();   		
        ЗаполнитьЗначенияСвойств(ДокументПриход, ДанныеДляЗаполненияШапки); 
		
		НоваяСтрока = ДокументПриход.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДляЗаполненияТабличнойЧасти); 
		
        ДокументПриход.Записать(РежимЗаписиДокумента.Проведение);
        МассивДокументов.Добавить(ДокументПриход); 
		
    КонецЦикла;

	Для Сч = 0 По 2 Цикл      
		
	    ДокументРасход = Документы.РасходТовара.СоздатьДокумент();
        ЗаполнитьЗначенияСвойств(ДокументРасход, ДанныеДляЗаполненияШапки);   

		НоваяСтрока = ДокументРасход.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДляЗаполненияТабличнойЧасти); 		
		
        ДокументРасход.Записать(РежимЗаписиДокумента.Проведение);
        МассивДокументов.Добавить(ДокументРасход);    
		
	КонецЦикла;
	
	Для Каждого Документ Из МассивДокументов Цикл
		
        ЮТест.ОжидаетЧто(Документ)
            .Свойство("Проведен").Равно(Истина);
			
		ПроверитьДвиженияДокумента(Документ.Ссылка);	
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПроверитьВыходВНоль() Экспорт

	МассивДокументов = Новый Массив;
	
	ДанныеДляЗаполненияШапки = ПолучитьДанныеДляЗаполненияШапки();
	ДанныеДляЗаполненияТабличнойЧасти = ПолучитьДанныеДляЗаполненияТабличнойЧасти();
		
	Для Сч = 0 По 2 Цикл      
		
        ДокументПриход = Документы.ПриходТовара.СоздатьДокумент();   		
        ЗаполнитьЗначенияСвойств(ДокументПриход, ДанныеДляЗаполненияШапки); 
		
		НоваяСтрока = ДокументПриход.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДляЗаполненияТабличнойЧасти);  
		
        ДокументПриход.Записать(РежимЗаписиДокумента.Проведение);
        МассивДокументов.Добавить(ДокументПриход); 
		
    КонецЦикла;

	Для Сч = 0 По 2 Цикл      
		
	    ДокументРасход = Документы.РасходТовара.СоздатьДокумент();
        ЗаполнитьЗначенияСвойств(ДокументРасход, ДанныеДляЗаполненияШапки);   

		НоваяСтрока = ДокументРасход.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДляЗаполненияТабличнойЧасти);
		
        ДокументРасход.Записать(РежимЗаписиДокумента.Проведение);
        МассивДокументов.Добавить(ДокументРасход);    
		
	КонецЦикла;	

	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.ТоварныеЗапасы.Остатки";
	ОписаниеЗапроса.Условия.Добавить("Товар = &Товар");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Товар", ДанныеДляЗаполненияТабличнойЧасти.Товар);  
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Товар");

	ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапроса)).ЭтоИстина();
	
	
	ОписаниеЗапроса = ЮТЗапросы.ОписаниеЗапроса();
	ОписаниеЗапроса.ИмяТаблицы = "РегистрНакопления.Взаиморасчеты.Остатки";
	ОписаниеЗапроса.Условия.Добавить("Контрагент = &Контрагент");
	ОписаниеЗапроса.ЗначенияПараметров.Вставить("Контрагент", ДанныеДляЗаполненияШапки.Покупатель);  
	ОписаниеЗапроса.ВыбираемыеПоля.Добавить("Контрагент");

	ЮТест.ОжидаетЧто(ЮТЗапросы.РезультатПустой(ОписаниеЗапроса)).ЭтоИстина();	
		
	
	
КонецПроцедуры

Процедура ПроверитьДвиженияДокумента(Регистратор)
	
	Записи = ЮТЗапросы.Записи("РегистрНакопления.ТоварныеЗапасы",
	    ЮТест.Предикат()
	        .Реквизит("Регистратор").Равно(Регистратор));

	ЮТест.ОжидаетЧто(Записи)
	    .ИмеетТип("Массив")
	    .ИмеетДлину(1);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции  

Функция ПолучитьДанныеДляЗаполненияШапки()
	
	ДанныеДляЗаполненияШапки = Новый Структура;
	ДанныеДляЗаполненияШапки.Вставить("Организация", Справочники.Организации.НайтиПоКоду("000000003"));  
	ДанныеДляЗаполненияШапки.Вставить("Склад", Справочники.Склады.НайтиПоКоду("000000004"));
	ДанныеДляЗаполненияШапки.Вставить("Поставщик", Справочники.Контрагенты.НайтиПоКоду("000000017"));   
	ДанныеДляЗаполненияШапки.Вставить("Покупатель", Справочники.Контрагенты.НайтиПоКоду("000000017"));
	ДанныеДляЗаполненияШапки.Вставить("ВидЦен", Справочники.ВидыЦен.НайтиПоКоду("000000003"));
	ДанныеДляЗаполненияШапки.Вставить("Валюта", Справочники.Валюты.НайтиПоКоду("000000001"));
	ДанныеДляЗаполненияШапки.Вставить("Дата", ТекущаяДата()); 
	
	Возврат ДанныеДляЗаполненияШапки;
	
КонецФункции 

Функция ПолучитьДанныеДляЗаполненияТабличнойЧасти()
	
	ДанныеДляЗаполненияТабличнойЧасти = Новый Структура;
	ДанныеДляЗаполненияТабличнойЧасти.Вставить("Товар", Справочники.Товары.НайтиПоКоду("000000016"));  
	ДанныеДляЗаполненияТабличнойЧасти.Вставить("Цена", 11500);
	ДанныеДляЗаполненияТабличнойЧасти.Вставить("Количество", 2);   
	ДанныеДляЗаполненияТабличнойЧасти.Вставить("Сумма", 15000);
	
	Возврат ДанныеДляЗаполненияТабличнойЧасти;
	
КонецФункции 

#КонецОбласти 
